In [1]:
import numpy as np
import pandas as pd

In [3]:
s = pd.Series(np.random.rand(4), ['A','B','C','D'])
s

A    0.193031
B    0.124045
C    0.954352
D    0.871118
dtype: float64

In [4]:
s[0]

0.19303104486639855

In [6]:
s > s.median()

A    False
B    False
C     True
D     True
dtype: bool

In [7]:
np.exp(s)

A    1.212920
B    1.132067
C    2.596987
D    2.389581
dtype: float64

In [9]:
s.array

<PandasArray>
[0.19303104486639855, 0.12404477904099298, 0.954352067560053,
 0.8711179880307012]
Length: 4, dtype: float64

In [13]:
data = np.random.randn(5)

In [14]:
index = ['A','B','C','D','E']

In [15]:
x = pd.Series(data=data, index=index)
x

A   -0.464082
B   -1.437113
C   -1.166941
D   -0.405108
E    1.746104
dtype: float64

In [16]:
x = x.to_frame()

In [17]:
x

          0
A -0.464082
B -1.437113
C -1.166941
D -0.405108
E  1.746104

In [18]:
col = ['satu','dua','tiga','empat','lima']

In [20]:
data = np.random.randn(5,5)

In [21]:
x = pd.DataFrame(data=data, index=index, columns=col)
x

       satu       dua      tiga     empat      lima
A  0.474975  0.080198 -2.012270 -0.306186 -0.023745
B  0.043886  0.669431 -0.330522 -0.206916 -0.213657
C -0.643941  0.145005  0.574529  1.401776  0.000769
D -0.797573  0.784946 -2.020044 -0.694169 -0.482117
E  1.222911 -1.540818  0.006594  0.049036 -1.301506

In [22]:
d = {"one": pd.Series([1.0, 2.0, 3.0], index=["a", "b", "c"]),
    "two": pd.Series([1.0, 2.0, 3.0, 4.0], index=["a", "b", "c", "d"])}

In [25]:
df = pd.DataFrame(d)
df

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [26]:
pd.DataFrame(d, index=['d','b','a'])

   one  two
d  NaN  4.0
b  2.0  2.0
a  1.0  1.0

In [27]:
df.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [30]:
data = np.zeros((2,), dtype=[("A", "i4"), ("B", "f4"), ("C", "a10")])
data[:] = [(1, 2.0, "Hello"), (2, 3.0, "World")]

In [31]:
pd.DataFrame(data)

   A    B         C
0  1  2.0  b'Hello'
1  2  3.0  b'World'

In [34]:
z = pd.DataFrame(data, index=['A','B'])
z

   A    B         C
A  1  2.0  b'Hello'
B  2  3.0  b'World'

In [35]:
data2 = [{'a':1, 'b':2}, {'a':3, 'b':4, 'c':10}]

In [36]:
pd.DataFrame(data2)

   a  b     c
0  1  2   NaN
1  3  4  10.0

In [38]:
y = pd.DataFrame(data2, index=['first','second'])
y

        a  b     c
first   1  2   NaN
second  3  4  10.0